Revit 2027 API
AnalysisDisplayDeformedShapeSettings.TextLabelType Property
 Type of deformed shape text visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get; set; }
Public Property TextLabelType As AnalysisDisplayStyleDeformedShapeTextLabelType
	Get
	Set
public:
property AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType {
	AnalysisDisplayStyleDeformedShapeTextLabelType get ();
	void set (AnalysisDisplayStyleDeformedShapeTextLabelType value);
}
member TextLabelType : AnalysisDisplayStyleDeformedShapeTextLabelType with get, set
Property Value
AnalysisDisplayStyleDeformedShapeTextLabelType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace